Printrbot/Printrhub/Hardware/Bootloading/esp8266-arm-swd/src/arm_kinetis_reg.h
/*
 * Register definitions for remote debugging on the Freescale Kinetis chips.
 * Based on definitions from:
 *
 * Teensyduino Core Library
 * http://www.pjrc.com/teensy/
 * Copyright (c) 2013 PJRC.COM, LLC.
 *
 * Permission is hereby granted, free of charge, to any person obtaining
 * a copy of this software and associated documentation files (the
 * "Software"), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish,
 * distribute, sublicense, and/or sell copies of the Software, and to
 * permit persons to whom the Software is furnished to do so, subject to
 * the following conditions:
 *
 * 1. The above copyright notice and this permission notice shall be
 * included in all copies or substantial portions of the Software.
 *
 * 2. If the Software is incorporated into a build system that allows
 * selection among a list of target devices, then similar target
 * devices manufactured by PJRC.COM must be included in the list of
 * target devices and selectable in the same manner.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
 * NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
 * BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
 * ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

#pragma once
#include "arm_reg.h"

// chapter 11: Port control and interrupts (PORT)
#define REG_PORTA_PCR0              0x40049000            // Pin Control Register n
#define REG_PORT_PCR_ISF            0x01000000            // Interrupt Status Flag
#define REG_PORT_PCR_IRQC(n)        (((n) & 15) << 16)    // Interrupt Configuration
#define REG_PORT_PCR_IRQC_MASK      0x000F0000
#define REG_PORT_PCR_LK             0x00008000            // Lock Register
#define REG_PORT_PCR_MUX(n)         (((n) & 7) << 8)      // Pin Mux Control
#define REG_PORT_PCR_MUX_MASK       0x00000700
#define REG_PORT_PCR_DSE            0x00000040            // Drive Strength Enable
#define REG_PORT_PCR_ODE            0x00000020            // Open Drain Enable
#define REG_PORT_PCR_PFE            0x00000010            // Passive Filter Enable
#define REG_PORT_PCR_SRE            0x00000004            // Slew Rate Enable
#define REG_PORT_PCR_PE             0x00000002            // Pull Enable
#define REG_PORT_PCR_PS             0x00000001            // Pull Select
#define REG_PORTA_PCR1              0x40049004            // Pin Control Register n
#define REG_PORTA_PCR2              0x40049008            // Pin Control Register n
#define REG_PORTA_PCR3              0x4004900C            // Pin Control Register n
#define REG_PORTA_PCR4              0x40049010            // Pin Control Register n
#define REG_PORTA_PCR5              0x40049014            // Pin Control Register n
#define REG_PORTA_PCR6              0x40049018            // Pin Control Register n
#define REG_PORTA_PCR7              0x4004901C            // Pin Control Register n
#define REG_PORTA_PCR8              0x40049020            // Pin Control Register n
#define REG_PORTA_PCR9              0x40049024            // Pin Control Register n
#define REG_PORTA_PCR10             0x40049028            // Pin Control Register n
#define REG_PORTA_PCR11             0x4004902C            // Pin Control Register n
#define REG_PORTA_PCR12             0x40049030            // Pin Control Register n
#define REG_PORTA_PCR13             0x40049034            // Pin Control Register n
#define REG_PORTA_PCR14             0x40049038            // Pin Control Register n
#define REG_PORTA_PCR15             0x4004903C            // Pin Control Register n
#define REG_PORTA_PCR16             0x40049040            // Pin Control Register n
#define REG_PORTA_PCR17             0x40049044            // Pin Control Register n
#define REG_PORTA_PCR18             0x40049048            // Pin Control Register n
#define REG_PORTA_PCR19             0x4004904C            // Pin Control Register n
#define REG_PORTA_PCR20             0x40049050            // Pin Control Register n
#define REG_PORTA_PCR21             0x40049054            // Pin Control Register n
#define REG_PORTA_PCR22             0x40049058            // Pin Control Register n
#define REG_PORTA_PCR23             0x4004905C            // Pin Control Register n
#define REG_PORTA_PCR24             0x40049060            // Pin Control Register n
#define REG_PORTA_PCR25             0x40049064            // Pin Control Register n
#define REG_PORTA_PCR26             0x40049068            // Pin Control Register n
#define REG_PORTA_PCR27             0x4004906C            // Pin Control Register n
#define REG_PORTA_PCR28             0x40049070            // Pin Control Register n
#define REG_PORTA_PCR29             0x40049074            // Pin Control Register n
#define REG_PORTA_PCR30             0x40049078            // Pin Control Register n
#define REG_PORTA_PCR31             0x4004907C            // Pin Control Register n
#define REG_PORTA_GPCLR             0x40049080            // Global Pin Control Low Register
#define REG_PORTA_GPCHR             0x40049084            // Global Pin Control High Register
#define REG_PORTA_ISFR              0x400490A0            // Interrupt Status Flag Register
#define REG_PORTB_PCR0              0x4004A000            // Pin Control Register n
#define REG_PORTB_PCR1              0x4004A004            // Pin Control Register n
#define REG_PORTB_PCR2              0x4004A008            // Pin Control Register n
#define REG_PORTB_PCR3              0x4004A00C            // Pin Control Register n
#define REG_PORTB_PCR4              0x4004A010            // Pin Control Register n
#define REG_PORTB_PCR5              0x4004A014            // Pin Control Register n
#define REG_PORTB_PCR6              0x4004A018            // Pin Control Register n
#define REG_PORTB_PCR7              0x4004A01C            // Pin Control Register n
#define REG_PORTB_PCR8              0x4004A020            // Pin Control Register n
#define REG_PORTB_PCR9              0x4004A024            // Pin Control Register n
#define REG_PORTB_PCR10             0x4004A028            // Pin Control Register n
#define REG_PORTB_PCR11             0x4004A02C            // Pin Control Register n
#define REG_PORTB_PCR12             0x4004A030            // Pin Control Register n
#define REG_PORTB_PCR13             0x4004A034            // Pin Control Register n
#define REG_PORTB_PCR14             0x4004A038            // Pin Control Register n
#define REG_PORTB_PCR15             0x4004A03C            // Pin Control Register n
#define REG_PORTB_PCR16             0x4004A040            // Pin Control Register n
#define REG_PORTB_PCR17             0x4004A044            // Pin Control Register n
#define REG_PORTB_PCR18             0x4004A048            // Pin Control Register n
#define REG_PORTB_PCR19             0x4004A04C            // Pin Control Register n
#define REG_PORTB_PCR20             0x4004A050            // Pin Control Register n
#define REG_PORTB_PCR21             0x4004A054            // Pin Control Register n
#define REG_PORTB_PCR22             0x4004A058            // Pin Control Register n
#define REG_PORTB_PCR23             0x4004A05C            // Pin Control Register n
#define REG_PORTB_PCR24             0x4004A060            // Pin Control Register n
#define REG_PORTB_PCR25             0x4004A064            // Pin Control Register n
#define REG_PORTB_PCR26             0x4004A068            // Pin Control Register n
#define REG_PORTB_PCR27             0x4004A06C            // Pin Control Register n
#define REG_PORTB_PCR28             0x4004A070            // Pin Control Register n
#define REG_PORTB_PCR29             0x4004A074            // Pin Control Register n
#define REG_PORTB_PCR30             0x4004A078            // Pin Control Register n
#define REG_PORTB_PCR31             0x4004A07C            // Pin Control Register n
#define REG_PORTB_GPCLR             0x4004A080            // Global Pin Control Low Register
#define REG_PORTB_GPCHR             0x4004A084            // Global Pin Control High Register
#define REG_PORTB_ISFR              0x4004A0A0            // Interrupt Status Flag Register
#define REG_PORTC_PCR0              0x4004B000            // Pin Control Register n
#define REG_PORTC_PCR1              0x4004B004            // Pin Control Register n
#define REG_PORTC_PCR2              0x4004B008            // Pin Control Register n
#define REG_PORTC_PCR3              0x4004B00C            // Pin Control Register n
#define REG_PORTC_PCR4              0x4004B010            // Pin Control Register n
#define REG_PORTC_PCR5              0x4004B014            // Pin Control Register n
#define REG_PORTC_PCR6              0x4004B018            // Pin Control Register n
#define REG_PORTC_PCR7              0x4004B01C            // Pin Control Register n
#define REG_PORTC_PCR8              0x4004B020            // Pin Control Register n
#define REG_PORTC_PCR9              0x4004B024            // Pin Control Register n
#define REG_PORTC_PCR10             0x4004B028            // Pin Control Register n
#define REG_PORTC_PCR11             0x4004B02C            // Pin Control Register n
#define REG_PORTC_PCR12             0x4004B030            // Pin Control Register n
#define REG_PORTC_PCR13             0x4004B034            // Pin Control Register n
#define REG_PORTC_PCR14             0x4004B038            // Pin Control Register n
#define REG_PORTC_PCR15             0x4004B03C            // Pin Control Register n
#define REG_PORTC_PCR16             0x4004B040            // Pin Control Register n
#define REG_PORTC_PCR17             0x4004B044            // Pin Control Register n
#define REG_PORTC_PCR18             0x4004B048            // Pin Control Register n
#define REG_PORTC_PCR19             0x4004B04C            // Pin Control Register n
#define REG_PORTC_PCR20             0x4004B050            // Pin Control Register n
#define REG_PORTC_PCR21             0x4004B054            // Pin Control Register n
#define REG_PORTC_PCR22             0x4004B058            // Pin Control Register n
#define REG_PORTC_PCR23             0x4004B05C            // Pin Control Register n
#define REG_PORTC_PCR24             0x4004B060            // Pin Control Register n
#define REG_PORTC_PCR25             0x4004B064            // Pin Control Register n
#define REG_PORTC_PCR26             0x4004B068            // Pin Control Register n
#define REG_PORTC_PCR27             0x4004B06C            // Pin Control Register n
#define REG_PORTC_PCR28             0x4004B070            // Pin Control Register n
#define REG_PORTC_PCR29             0x4004B074            // Pin Control Register n
#define REG_PORTC_PCR30             0x4004B078            // Pin Control Register n
#define REG_PORTC_PCR31             0x4004B07C            // Pin Control Register n
#define REG_PORTC_GPCLR             0x4004B080            // Global Pin Control Low Register
#define REG_PORTC_GPCHR             0x4004B084            // Global Pin Control High Register
#define REG_PORTC_ISFR              0x4004B0A0            // Interrupt Status Flag Register
#define REG_PORTD_PCR0              0x4004C000            // Pin Control Register n
#define REG_PORTD_PCR1              0x4004C004            // Pin Control Register n
#define REG_PORTD_PCR2              0x4004C008            // Pin Control Register n
#define REG_PORTD_PCR3              0x4004C00C            // Pin Control Register n
#define REG_PORTD_PCR4              0x4004C010            // Pin Control Register n
#define REG_PORTD_PCR5              0x4004C014            // Pin Control Register n
#define REG_PORTD_PCR6              0x4004C018            // Pin Control Register n
#define REG_PORTD_PCR7              0x4004C01C            // Pin Control Register n
#define REG_PORTD_PCR8              0x4004C020            // Pin Control Register n
#define REG_PORTD_PCR9              0x4004C024            // Pin Control Register n
#define REG_PORTD_PCR10             0x4004C028            // Pin Control Register n
#define REG_PORTD_PCR11             0x4004C02C            // Pin Control Register n
#define REG_PORTD_PCR12             0x4004C030            // Pin Control Register n
#define REG_PORTD_PCR13             0x4004C034            // Pin Control Register n
#define REG_PORTD_PCR14             0x4004C038            // Pin Control Register n
#define REG_PORTD_PCR15             0x4004C03C            // Pin Control Register n
#define REG_PORTD_PCR16             0x4004C040            // Pin Control Register n
#define REG_PORTD_PCR17             0x4004C044            // Pin Control Register n
#define REG_PORTD_PCR18             0x4004C048            // Pin Control Register n
#define REG_PORTD_PCR19             0x4004C04C            // Pin Control Register n
#define REG_PORTD_PCR20             0x4004C050            // Pin Control Register n
#define REG_PORTD_PCR21             0x4004C054            // Pin Control Register n
#define REG_PORTD_PCR22             0x4004C058            // Pin Control Register n
#define REG_PORTD_PCR23             0x4004C05C            // Pin Control Register n
#define REG_PORTD_PCR24             0x4004C060            // Pin Control Register n
#define REG_PORTD_PCR25             0x4004C064            // Pin Control Register n
#define REG_PORTD_PCR26             0x4004C068            // Pin Control Register n
#define REG_PORTD_PCR27             0x4004C06C            // Pin Control Register n
#define REG_PORTD_PCR28             0x4004C070            // Pin Control Register n
#define REG_PORTD_PCR29             0x4004C074            // Pin Control Register n
#define REG_PORTD_PCR30             0x4004C078            // Pin Control Register n
#define REG_PORTD_PCR31             0x4004C07C            // Pin Control Register n
#define REG_PORTD_GPCLR             0x4004C080            // Global Pin Control Low Register
#define REG_PORTD_GPCHR             0x4004C084            // Global Pin Control High Register
#define REG_PORTD_ISFR              0x4004C0A0            // Interrupt Status Flag Register
#define REG_PORTE_PCR0              0x4004D000            // Pin Control Register n
#define REG_PORTE_PCR1              0x4004D004            // Pin Control Register n
#define REG_PORTE_PCR2              0x4004D008            // Pin Control Register n
#define REG_PORTE_PCR3              0x4004D00C            // Pin Control Register n
#define REG_PORTE_PCR4              0x4004D010            // Pin Control Register n
#define REG_PORTE_PCR5              0x4004D014            // Pin Control Register n
#define REG_PORTE_PCR6              0x4004D018            // Pin Control Register n
#define REG_PORTE_PCR7              0x4004D01C            // Pin Control Register n
#define REG_PORTE_PCR8              0x4004D020            // Pin Control Register n
#define REG_PORTE_PCR9              0x4004D024            // Pin Control Register n
#define REG_PORTE_PCR10             0x4004D028            // Pin Control Register n
#define REG_PORTE_PCR11             0x4004D02C            // Pin Control Register n
#define REG_PORTE_PCR12             0x4004D030            // Pin Control Register n
#define REG_PORTE_PCR13             0x4004D034            // Pin Control Register n
#define REG_PORTE_PCR14             0x4004D038            // Pin Control Register n
#define REG_PORTE_PCR15             0x4004D03C            // Pin Control Register n
#define REG_PORTE_PCR16             0x4004D040            // Pin Control Register n
#define REG_PORTE_PCR17             0x4004D044            // Pin Control Register n
#define REG_PORTE_PCR18             0x4004D048            // Pin Control Register n
#define REG_PORTE_PCR19             0x4004D04C            // Pin Control Register n
#define REG_PORTE_PCR20             0x4004D050            // Pin Control Register n
#define REG_PORTE_PCR21             0x4004D054            // Pin Control Register n
#define REG_PORTE_PCR22             0x4004D058            // Pin Control Register n
#define REG_PORTE_PCR23             0x4004D05C            // Pin Control Register n
#define REG_PORTE_PCR24             0x4004D060            // Pin Control Register n
#define REG_PORTE_PCR25             0x4004D064            // Pin Control Register n
#define REG_PORTE_PCR26             0x4004D068            // Pin Control Register n
#define REG_PORTE_PCR27             0x4004D06C            // Pin Control Register n
#define REG_PORTE_PCR28             0x4004D070            // Pin Control Register n
#define REG_PORTE_PCR29             0x4004D074            // Pin Control Register n
#define REG_PORTE_PCR30             0x4004D078            // Pin Control Register n
#define REG_PORTE_PCR31             0x4004D07C            // Pin Control Register n
#define REG_PORTE_GPCLR             0x4004D080            // Global Pin Control Low Register
#define REG_PORTE_GPCHR             0x4004D084            // Global Pin Control High Register
#define REG_PORTE_ISFR              0x4004D0A0            // Interrupt Status Flag Register

